Revit 2027 API
BuiltInFailures.SectionViewFailures.ScopeBoxBehindSection Property
 Section may not be associated to a scope box which lies behind it.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ScopeBoxBehindSection { get; }
Public Shared ReadOnly Property ScopeBoxBehindSection As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ScopeBoxBehindSection {
	FailureDefinitionId^ get ();
}
static member ScopeBoxBehindSection : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SectionViewFailures Class
Autodesk.Revit.DB Namespace